app/controllers/areas_controller.rb

SELECT "areas".* FROM "areas" ORDER BY description ASC
---
  def index
    @areas = Area.all

SELECT "areas".* FROM "areas" WHERE "areas"."id" = $1 ORDER BY description ASC LIMIT 1  [["id", "980190962"]]
---
  def edit
    @area = Area.find(params[:id])

INSERT INTO "areas" ("created_at", "description", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Sat, 18 Aug 2012 13:35:10 BRT -03:00], ["description", "Não infestada"], ["updated_at", Sat, 18 Aug 2012 13:35:10 BRT -03:00]]
---
  def create
    @area = Area.new(params[:area])

    respond_to do |format|
      if @area.save

DELETE FROM "areas" WHERE "areas"."id" = $1  [["id", 980190962]]
---
  def destroy
    edit
    @area.destroy