app/controllers/inspections_controller.rb

SELECT "inspections".* FROM "inspections"
---
  def index
    @inspections = Inspection.all

SELECT "inspections".* FROM "inspections" WHERE "inspections"."id" = $1 LIMIT 1  [["id", "980190962"]]
---
  def show
    @inspection = Inspection.find(params[:id])

DELETE FROM "inspections" WHERE "inspections"."id" = $1  [["id", 980190962]]
---
  def destroy
    show
    @inspection.destroy