app/controllers/places_controller.rb

SELECT "places".* FROM "places" ORDER BY description ASC
---
  def index
    @places = Place.all

SELECT "places".* FROM "places" WHERE "places"."id" = $1 ORDER BY description ASC LIMIT 1  [["id", "980190962"]]
---
  def edit
    @place = Place.find(params[:id])

INSERT INTO "places" ("created_at", "description", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Sat, 18 Aug 2012 13:35:11 BRT -03:00], ["description", "Caixa d'água"], ["updated_at", Sat, 18 Aug 2012 13:35:11 BRT -03:00]]
---
  def create
    @place = Place.new(params[:place])

    respond_to do |format|
      if @place.save

DELETE FROM "places" WHERE "places"."id" = $1  [["id", 980190962]]
---
  def destroy
    edit
    @place.destroy